# 2차원 평면 위에 N개의 서로 다른 점이 있다. 각 점의 x, y 좌표는 정수이다.
# 당신은 이 중 서로 다른 3개의 점을 골라서 삼각형을 만들려고 한다.
# 이 때 삼각형의 한 변은 x축에 평행해야 하고, 다른 한 변은 y축에 평행해야 한다.
 
# 당신이 만들 수 있는 삼각형의 최대 넓이는 얼마인가?
# 넓이에 2를 곱하면 정수가 되니, 최대 넓이에 2를 곱해 출력하라.
# 만들 수 있는 삼각형이 최소 하나 존재한다. 


# [입력]
# 첫 번째 줄에 테스트 케이스의 수 TC가 주어진다.
# 이후 TC개의 테스트 케이스가 새 줄로 구분되어 주어진다.
# 각 테스트 케이스는 다음과 같이 구성되었다. 
#     -  첫 번째 줄에 점의 수 N이 주어진다. (3 ≤ N ≤ 100)
#     -  이후 N개의 줄에 점의 좌표 xi, yi 가 주어진다. 모든 좌표는 서로 다르고, 좌표는 절댓값이 10000 이하인 정수이다. 


# [출력]
# 각 테스트 케이스 마다 한 줄씩, 문제의 정답을 출력하라.