# 세준이는 무한한 이차원 평면 위에서 살고 있다.
# 세준이의 집은 원점이며, 자신의 집에서 출발하여 N일 동안 여행을 한 후, 다시 자신의 집으로 돌아가려 한다. 
# 세준이의 여행 계획을 자세하게 말하면 다음과 같다

#     -  여행의 첫 번째 날은 집에서 출발한다. 
#     -  i (1 ≤ i ≤ N)번째 날에는 동서남북 중 Ai 방향으로 양의 정수 거리만큼 이동한다. 거리는 양의 정수이기만 하면 마음대로 정할 수 있다.
#     -  N번째 날에는 이동을 끝낸 순간 집에 도착하여야 한다. 

# 길이 N의 문자열 A가 주어질 때, 여행의 마지막 날에 집에 돌아올 수 있도록, 각 날의 이동 거리를 정할 수 있는지 판별하는 프로그램을 작성하시오.


# [입력]
# 첫 번째 줄에 테스트 케이스의 수 TC가 주어진다.
# 이후 TC개의 테스트 케이스가 새 줄로 구분되어 주어진다.
# 각 테스트 케이스는 다음과 같이 구성되었다. 
#     -  첫 번째 줄에 문자열 A가 주어진다. 문자열 A는 네 개의 문자 ‘N’, ‘W’, ‘S’, ‘E’ 로 이루어져 있으며, 이는 각각 ‘북쪽’, ‘서쪽’, ‘남쪽’, ‘동쪽’ 을 의미한다. 문자열 A의 길이는 1 이상 1000 이하이다. 


# [출력]
# 각 테스트 케이스 마다 한 줄씩, 정할 수 있다면 “Yes”, 없다면 “No” 를 출력하라. 

